app/controllers/playlists_controller.rb

  def show
    @playlist = Playlist.find_by_id(params[:id])
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = 150 LIMIT 1

  def edit
    @playlist = Playlist.find_by_id(params[:id])
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = 221 LIMIT 1

  def create

    # UUID has to be unique, so find a unique UUID
    i = 0
    uuid = ""
    begin
       i += 1
      uuid = "[Undefined #{i}]"
      playlist = Playlist.where("uuid = ?", uuid).first
    end while not playlist.nil?

    playlist = Playlist.new(:name => params[:name], :uuid => uuid)

    respond_to do |format|
      if playlist.save
---
SELECT 1 FROM "playlists" WHERE "playlists"."uuid" = '[Undefined 2]' LIMIT 1
INSERT INTO "playlists" ("created_at", "name", "updated_at", "uuid") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 03 Jul 2012 16:18:29 UTC +00:00], ["name", "[New Playlist]"], ["updated_at", Tue, 03 Jul 2012 16:18:29 UTC +00:00], ["uuid", "[Undefined 2]"]]

  def update
    @playlist = Playlist.find_by_id(params[:id])

    respond_to do |format|
      if @playlist.nil?
        format.html { redirect_to playlists_url }
        format.json { render_id_error(params[:id]) }
      elsif @playlist.update_attributes(params[:playlist])
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = 237 LIMIT 1
UPDATE "playlists" SET "name" = 'Playlist1', "updated_at" = '2012-07-21 22:49:40.103852' WHERE "playlists"."id" = 237

  def destroy
    playlist = Playlist.find_by_id(params[:id])

    respond_to do |format|
      if playlist.nil?
        format.json { render_id_error(params[:id]) }
      elsif playlist.destroy
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = 220 LIMIT 1
DELETE FROM "playlists" WHERE "playlists"."id" = $1  [["id", 220]]