app/controllers/playlist_queues_controller.rb

SELECT "playlist_queues".* FROM "playlist_queues" WHERE "playlist_queues"."id" = 1736 LIMIT 1
DELETE FROM "playlist_queues" WHERE "playlist_queues"."id" = $1  [["id", 1736]]
---
  def destroy
    playlist_queue = PlaylistQueue.find_by_id(params[:id])

    respond_to do |format|
      if playlist_queue.nil?
        format.html { redirect_to playlists_url }
        format.json { render_id_error(params[:id]) }
      elsif playlist_queue.destroy