app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."id" = 321 LIMIT 1
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 321]]
---
  def destroy
    song = Song.find_by_id(params[:id])

    respond_to do |format|
      if song.nil?
        format.json { render_id_error("Song", params[:id]) }
      elsif song.destroy

SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = 221 LIMIT 1
INSERT INTO "songs" ("created_at", "name", "playlist_id", "updated_at", "url") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 03 Jul 2012 16:20:11 UTC +00:00], ["name", "[NewSong]"], ["playlist_id", 221], ["updated_at", Tue, 03 Jul 2012 16:20:11 UTC +00:00], ["url", "http://www.example.com/song.mp3"]]
---
  def create

   playlist = Playlist.find_by_id(params[:playlist_id])

    if playlist.nil?
      respond_to do |format|
        format.json { render_id_error("Playlist", params[:id]) }
      end
    elsif

      song = Song.new(:name => params[:name], :url => params[:url], :playlist => playlist)

      respond_to do |format|
        if song.save